app/controllers/streams_controller.rb

  def index
    stream = Stream.first()

    # Initialize images used by slideshow.
    @images = stream.images.select('object_name')

    # Initialize soundcloud.
    client = Soundcloud.new(client_id: ENV['SOUNDCLOUD_CLIENT_ID'])
    track_url = stream.sounds.first().soundcloud_url
---
SELECT  images, object_name FROM "streams"  ORDER BY "streams"."id" ASC LIMIT 1
SELECT  "images"."object_name" FROM "images" WHERE "images"."stream_id" = ?  ORDER BY "images"."id" ASC LIMIT 1  [["stream_id", 1]]
SELECT  "images".* FROM "images" WHERE "images"."stream_id" = ?  ORDER BY "images"."id" ASC LIMIT 1  [["stream_id", 1]]
SELECT  "sounds".* FROM "sounds" WHERE "sounds"."stream_id" = ?  ORDER BY "sounds"."id" ASC LIMIT 1  [["stream_id", 1]]